{
  "Three Laws of Robotics": "This is perhaps the first formal documentation of laws for AIs and robots, explicitly introduced in Isaac Asimov’s 1942 short story Runaround. Some guidelines have referenced the Three Laws, often in observation that they are adequate in light of current trends in AI.",
  "Singapore’s AI Governance Framework": "This is currently the main text on AI ethics and governance published by a Singaporean entity. I anticipate other reports to follow from the recently established SMU Centre for AI and Data Governance. It is interesting to observe the very pragmatic language used in this framework, even when compared to other guidelines. This probably stems primarily from its objective as a “ready-to-use tool”.",
  "Tencent ARCC": "This is actually a transcript of a speech by Jason Si (司晓), Executive Dean of Tencent Research Institute, at the 7th Annual Stanford-Peking University Internet Law and Policy Conference on 3 December 2018. There are only four principles - Available 可用, Reliable 可靠, Comprehensible 可知, Controllable 可控 - although each principle actually encompasses several different aspects.",
  "OECD's Recommendation of the Council on Artificial Intelligence": "This document contains a non-binding set of standards developed for members of the Organisation for Economic Co-operation and Development. It is primarily foundational and legislative in nature, which explains the language adopted. It includes a set of five principles and five recommendations for trustworthy AI.",
  "Montréal Declaration": "This is a very extensive report spanning over 300 pages from the Montréal Declaration, an initiative from the Université de Montréal, home of the prestigious Montreal Institute for Learning Algorithms (MILA). The Montréal Declaration is based on a co-construction process, meaning that individuals from all backgrounds are invited to provide input. The Declaration consists of 10 principles listed in the report's frontmatter.",
  "Google": "This is a post from Google’s official blog, authored by Google CEO Sundar Pichai on 7 June 2018, a month after the release of Google Duplex and several months prior to their ethics board disaster. In addition to the more general principles, the post also contains an explicit list of AI applications that Google will supposedly not pursue.",
  "Asilomar AI Principles": "This is one of the earlier publications on AI ethics after the advent of deep learning. Conceived by the Future of Life Institute, these 23 principles were developed during the 2017 FLI Beneficial AI conference. Of note, the principles have been translated to Chinese, German, Japanese and Russian, which implies its international target audience. The nature of the principles should be understood in context - FLI was founded to mitigate existential risks - specifically existential risks due to artificial intelligence. As such, these principles generally take a long-term big-picture perspective.",
  "ERLC's Evangelical Statement of Principles": "This is an article from the Ethics & Religious Liberty Commission (ERLC). Quoting from Wikipedia, “The Ethics & Religious Liberty Commission is the public policy arm of the Southern Baptist Convention, the largest non-Catholic Christian denomination in the United States, with over 16 million members in over 43,000 independent churches.” There are some interesting observations to be made here due to the unusual context and interplay of religion and technology.",
  "EU European Commission's Ethics Guidelines for Trustworthy AI": "This report from the European Commission focuses on the idea of Trustworthy AI. The report itself contains four main principles and seven key requirements for the implementation of AI systems.",
  "Beijing AI Principles": "This is a very new set of principles from China’s Beijing Academy of Artificial Intelligence (BAAI). There is a translation to English, which suggests an international target audience. There are 14 principles across three categories - R&D, Use and Governance. The article itself is brief but the principles are quite encompassing.",
  "Villani Report": "The report is also known as the Villani Report and alternatively titled For a Meaningful Artificial Intelligence — Towards a French and European Strategy. It lists five main principles."
}